Revit 2027 API
Family.ShowSpatialElementCalculationPoint Property
 For families that can have a calculation point for spatial elements, hide or show the calculation point. SpatialElementCalculationPoint elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ShowSpatialElementCalculationPoint { get; set; }
Public Property ShowSpatialElementCalculationPoint As Boolean
	Get
	Set
public:
property bool ShowSpatialElementCalculationPoint {
	bool get ();
	void set (bool value);
}
member ShowSpatialElementCalculationPoint : bool with get, set
Property Value
Boolean
See Also
Reference
Family Class
Autodesk.Revit.DB Namespace